In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("Employee.csv")
print(df, type(df))

   Id      Name   Age  Department   Salary
0   1     Alice    25          HR    55000
1   2       Bob    32          IT    72000
2   3   Charlie    28     Finance    48000
3   4     David    45   Marketing    91000
4   5       Eva    38          IT    65000
5   6     Frank    29     Finance    50000
6   7     Grace    41          HR    82000
7   8    Hannah    26   Marketing    47000
8   9       Ian    35          IT    75000
9  10     jULIA    30     Finance    25000 <class 'pandas.core.frame.DataFrame'>

In [8]:
#Pandas Dataframe methods
print(df.tail()) #last 5 rows by default
print(df.tail(3))

   Id     Name   Age  Department   Salary
5   6    Frank    29     Finance    50000
6   7    Grace    41          HR    82000
7   8   Hannah    26   Marketing    47000
8   9      Ian    35          IT    75000
9  10    jULIA    30     Finance    25000
   Id     Name   Age  Department   Salary
7   8   Hannah    26   Marketing    47000
8   9      Ian    35          IT    75000
9  10    jULIA    30     Finance    25000

In [6]:
print(df.head()) #first 5 rows by default
print(df.head(2))

   Id      Name   Age  Department   Salary
0   1     Alice    25          HR    55000
1   2       Bob    32          IT    72000
2   3   Charlie    28     Finance    48000
3   4     David    45   Marketing    91000
4   5       Eva    38          IT    65000
   Id    Name   Age  Department   Salary
0   1   Alice    25          HR    55000
1   2     Bob    32          IT    72000

In [ ]:
print(df.sample()) #Any random row will be retrieved

   Id    Name   Age  Department   Salary
3   4   David    45   Marketing    91000

In [ ]:
df.info() #Given a summary of the data (rows, colums)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Id           10 non-null     int64
 1    Name        10 non-null     object
 2    Age         10 non-null     int64
 3    Department  10 non-null     object
 4    Salary      10 non-null     int64
dtypes: int64(3), object(2)
memory usage: 532.0+ bytes

In [17]:
df.shape

(10, 5)

In [ ]:
df.describe() #Tries to give aa generic picture about the data(Only numerical values)
#like the mean, std, max etc     and the percentiles
#no explicit calculation was done by the programmer

             Id        Age        Salary
count  10.00000  10.000000     10.000000
mean    5.50000  32.900000  61000.000000
std     3.02765   6.674162  19697.715604
min     1.00000  25.000000  25000.000000
25%     3.25000  28.250000  48500.000000
50%     5.50000  31.000000  60000.000000
75%     7.75000  37.250000  74250.000000
max    10.00000  45.000000  91000.000000

In [24]:
df.columns

Index(['Id', ' Name', ' Age', ' Department', ' Salary'], dtype='object')

In [27]:
df.nunique()

Id             10
 Name          10
 Age           10
 Department     4
 Salary        10
dtype: int64

In [3]:
df

   Id      Name   Age  Department   Salary
0   1     Alice    25          HR    55000
1   2       Bob    32          IT    72000
2   3   Charlie    28     Finance    48000
3   4     David    45   Marketing    91000
4   5       Eva    38          IT    65000
5   6     Frank    29     Finance    50000
6   7     Grace    41          HR    82000
7   8    Hannah    26   Marketing    47000
8   9       Ian    35          IT    75000
9  10     jULIA    30     Finance    25000